In [92]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
from sklearn.model_selection import train_test_split
from sklearn.linear_model import LogisticRegression
from sklearn.metrics import accuracy_score
from sklearn.preprocessing import MinMaxScaler
from sklearn.svm import SVC
%matplotlib inline

In [ ]:
df=pd.read_csv("./train.csv")

In [149]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
y=df['Survived']

In [ ]:
X=df.drop(['Cabin','Embarked','Ticket','Fare','SibSp','Parch','Name','Survived'],axis=1)

In [57]:
X.head()

    Age  Sex_female  Sex_male  Pclass_1  Pclass_2  Pclass_3
0  22.0           0         1         0         0         1
1  38.0           1         0         1         0         0
2  26.0           1         0         0         0         1
3  35.0           1         0         1         0         0
4  35.0           0         1         0         0         1

In [ ]:
passenger_IDs=X['PassengerId']

In [ ]:
X=X.drop(['PassengerId'],axis=1)

In [59]:
X.head()

    Age  Sex_female  Sex_male  Pclass_1  Pclass_2  Pclass_3
0  22.0           0         1         0         0         1
1  38.0           1         0         1         0         0
2  26.0           1         0         0         0         1
3  35.0           1         0         1         0         0
4  35.0           0         1         0         0         1

In [64]:
X.head()

    Age  Sex_female  Sex_male  Pclass_1  Pclass_2  Pclass_3
0  22.0           0         1         0         0         1
1  38.0           1         0         1         0         0
2  26.0           1         0         0         0         1
3  35.0           1         0         1         0         0
4  35.0           0         1         0         0         1

In [ ]:
X=pd.get_dummies(X,columns=['Sex','Pclass'],prefix=['Sex','Pclass'])

In [62]:
X=X.fillna({'Age':29.7})

In [87]:
X_train,X_test,y_train,y_test=train_test_split(X,y,random_state=0)
scaler=MinMaxScaler()
X_train=scaler.fit_transform(X_train)
X_test=scaler.fit_transform(X_test)

In [137]:
clf=LogisticRegression(random_state=0).fit(X_train,y_train)
y_predict=clf.predict(X_test)
accuracy_score(y_test,y_predict)

/opt/anaconda3/lib/python3.7/site-packages/sklearn/linear_model/logistic.py:432: FutureWarning: Default solver will be changed to 'lbfgs' in 0.22. Specify a solver to silence this warning.
  FutureWarning)

0.7937219730941704

In [ ]:
# clf_SVM=SVC(kernel="linear").fit(X_train,y_train)
# y_predict_svm=clf_SVM.predict(X_train)
# accuracy_score(y_train,y_predict_svm)

In [104]:
df_test=pd.read_csv('./test.csv')

In [105]:
df_test.head()

,PassengerId,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
2,894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
3,895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
4,896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

In [107]:
df_test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [122]:
X_test_kaggle=df_test.drop(['Cabin','Embarked','Ticket','Fare','SibSp','Parch','Name'],axis=1)

In [140]:
passenger_ID_kaggle=df_test['PassengerId']

In [124]:
X_test_kaggle=X_test_kaggle.drop(['PassengerId'],axis=1)

In [129]:
X_test_kaggle.head()

    Age  Sex_female  Sex_male  Pclass_1  Pclass_2  Pclass_3
0  34.5           0         1         0         0         1
1  47.0           1         0         0         0         1
2  62.0           0         1         0         1         0
3  27.0           0         1         0         0         1
4  22.0           1         0         0         0         1

In [128]:
X_test_kaggle=pd.get_dummies(X_test_kaggle,columns=['Sex','Pclass'],prefix=['Sex','Pclass'])

In [131]:
X_test_kaggle=X_test_kaggle.fillna({'Age':30.3})

In [132]:
X_test_kaggle.head()

    Age  Sex_female  Sex_male  Pclass_1  Pclass_2  Pclass_3
0  34.5           0         1         0         0         1
1  47.0           1         0         0         0         1
2  62.0           0         1         0         1         0
3  27.0           0         1         0         0         1
4  22.0           1         0         0         0         1

In [133]:
y_predict_kaggle=clf.predict(X_test_kaggle)

In [144]:
df_submit=pd.DataFrame(list(zip(passenger_ID_kaggle, y_predict_kaggle)),columns=['PassengerId','Survived'])

In [145]:
df_submit.head()

   PassengerId  Survived
0          892         0
1          893         0
2          894         0
3          895         0
4          896         0

In [146]:
df_submit.to_csv("submit.csv",index=False)

In [ ]:
  #print 10 best features